apache/nuttx/arch/arm/src/xmc4/xmc4_i2c.c
/*****************************************************************************
 * arch/arm/src/xmc4/xmc4_i2c.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 *****************************************************************************/

/*****************************************************************************
 * Included Files
 *****************************************************************************/

#include <nuttx/config.h>

#include <sys/types.h>
#include <stdint.h>
#include <stdio.h>
#include <assert.h>
#include <errno.h>
#include <nuttx/debug.h>

#include <arch/board/board.h>
#include <nuttx/mutex.h>
#include <nuttx/irq.h>

#include "arm_internal.h"
#include "chip.h"

#include "hardware/xmc4_pinmux.h"
#include "hardware/xmc4_memorymap.h"
#include "hardware/xmc4_usic.h"
#include "xmc4_i2c.h"
#include "xmc4_usic.h"
#include "xmc4_gpio.h"

/* At least one I2C peripheral must be enabled */

#if defined(CONFIG_XMC4_USCI_I2C)

/*****************************************************************************
 * Pre-processor Definitions
 *****************************************************************************/

#define XMC_I2C_CLOCK_OVERSAMPLING_STANDARD (10U)
#define XMC_I2C_CLOCK_OVERSAMPLING_FAST (25U)
#define XMC_I2C_MAX_SPEED_STANDARD 100000UL
#define XMC_I2C_MAX_SPEED_FAST 400000
#define I2C_DEFAULT_FREQUENCY 400000

#define I2C_INPUT_DX_SDA (0U) /* I2C uses DX0 input stage as SDA */
#define I2C_INPUT_DX_SCL (1U) /* I2C uses DX1 input stage as SCL */

#define XMC_I2C_TDF_MASTER_SEND (0U)
#define XMC_I2C_TDF_SLAVE_SEND (1U << 8)
#define XMC_I2C_TDF_MASTER_RECEIVE_ACK (2U << 8)
#define XMC_I2C_TDF_MASTER_RECEIVE_NACK (3U << 8)
#define XMC_I2C_TDF_MASTER_START (4U << 8)
#define XMC_I2C_TDF_MASTER_RESTART (5U << 8)
#define XMC_I2C_TDF_MASTER_STOP (6U << 8)

#define XMC_I2C_CMD_WRITE (0U)
#define XMC_I2C_CMD_READ (1U)

#define I2C_WORDLENGTH (7U) /* 8 bits word length */
#define I2C_TRM_MODE (3U)   /* Shift and transfer config */

#define I2C_TDV_SET (1U) /* A transmission of data in TBUF \
                          * can be started if TDV = 1 */

/*****************************************************************************
 * Private Types
 *****************************************************************************/

typedef enum xmc_usic_ch_input
{
  XMC_USIC_CH_INPUT_DX0, /* DX0 input */
  XMC_USIC_CH_INPUT_DX1, /* DX1 input */
  XMC_USIC_CH_INPUT_DX2, /* DX2 input */
  XMC_USIC_CH_INPUT_DX3, /* DX3 input */
  XMC_USIC_CH_INPUT_DX4, /* DX4 input */
  XMC_USIC_CH_INPUT_DX5  /* DX5 input */
} xmc_usic_ch_input_t;

typedef enum xmc_usic_ch_source
{
  XMC_USIC_CH_INPUT_DXNA, /* DXnA source signal */
  XMC_USIC_CH_INPUT_DXNB, /* DXnB source signal */
  XMC_USIC_CH_INPUT_DXNC, /* DXnC source signal */
  XMC_USIC_CH_INPUT_DXND, /* DXnD source signal */
  XMC_USIC_CH_INPUT_DXNE, /* DXnE source signal */
  XMC_USIC_CH_INPUT_DXNF, /* DXnF source signal */
  XMC_USIC_CH_INPUT_DXNG, /* DXnG source signal */
  XMC_USIC_CH_INPUT_DXN1  /* Signal always high */
} xmc_usic_ch_source_t;

/* This structure represents the state of one i2c channel */

struct xmc4_i2cdev_s
{
  const struct i2c_ops_s *ops;       /* Generic I2C device operation */
  const uint32_t base;               /* Base address of registers */
  const enum usic_channel_e channel; /* USIC channel */

  uint32_t frequency; /* Current I2C frequency */

  xmc_usic_ch_source_t dx0_sda; /* Source signal of SDA */
  xmc_usic_ch_source_t dx1_scl; /* Source signal of SCL */
  uint32_t sda_gpio;            /* GPIO config of SDA */
  uint32_t scl_gpio;            /* GPIO config of SCL */

  mutex_t lock; /* Only one thread can access at a time */
  int refs;     /* Reference count */
};

/*****************************************************************************
 * Private Function Prototypes
 *****************************************************************************/

static inline void xmc4_i2c_putreg32(struct xmc4_i2cdev_s *priv,
                                     uint32_t offset,
                                     uint32_t value);
static inline uint32_t xmc4_i2c_getreg32(struct xmc4_i2cdev_s *priv,
                                         uint32_t offset);
static inline void xmc4_i2c_modifyreg32(struct xmc4_i2cdev_s *priv,
                                        uint32_t offset,
                                        uint32_t clearbits,
                                        uint32_t setbits);

static int i2c_set_baudrate(struct xmc4_i2cdev_s *priv);
static int i2c_set_input_source(struct xmc4_i2cdev_s *priv);
static void i2c_start_channel(struct xmc4_i2cdev_s *priv);
static void i2c_stop_channel(struct xmc4_i2cdev_s *priv);
static bool i2c_get_status_flag(struct xmc4_i2cdev_s *priv,
                                const uint32_t flag_mask);
static int i2c_clear_status_flag(struct xmc4_i2cdev_s *priv,
                                  const uint32_t flag_mask);
static bool i2c_get_transmit_buffer_status(struct xmc4_i2cdev_s *priv);
static void i2c_fill_transmit_buffer(struct xmc4_i2cdev_s *priv,
                                      const uint32_t data);
static uint8_t i2c_get_receive_buffer(struct xmc4_i2cdev_s *priv);

static void i2c_start(struct xmc4_i2cdev_s *priv,
                      const uint16_t addr,
                      const bool read,
                      const bool restart);
static void i2c_stop(struct xmc4_i2cdev_s *priv);
static void i2c_master_transmit(struct xmc4_i2cdev_s *priv,
                                const uint8_t data);
static void i2c_master_ack(struct xmc4_i2cdev_s *priv);
static void i2c_master_nack(struct xmc4_i2cdev_s *priv);
static void i2c_wait_for_slave_ack(struct xmc4_i2cdev_s *priv);
static void i2c_wait_for_received_data_ready(struct xmc4_i2cdev_s *priv);

static int i2c_initialize(struct xmc4_i2cdev_s *priv);
static int i2c_uninitialize(struct xmc4_i2cdev_s *priv);

