apache/nuttx/arch/arm/src/xmc4/xmc4_i2c.c
static int i2c_transfer(struct i2c_master_s *dev,
                        struct i2c_msg_s *msgs,
                        int count);
#ifdef CONFIG_I2C_RESET
static int i2c_reset(struct i2c_master_s *dev);
#endif
/*****************************************************************************
 * Private Data
 *****************************************************************************/

struct i2c_ops_s xmc4_i2c_ops =
{
  .transfer = i2c_transfer,
#ifdef CONFIG_I2C_RESET
  .reset = i2c_reset,
#endif
};

#ifdef CONFIG_XMC4_I2C0
static struct xmc4_i2cdev_s g_i2c0 =
{
  .ops = &xmc4_i2c_ops,
  .base = XMC4_USIC0_CH0_BASE,
  .channel = USIC0_CHAN0,
  .dx0_sda = BOARD_I2C0_SDA_DX, /* See i2c_set_input_source */
  .dx1_scl = BOARD_I2C0_SCL_DX, /* See i2c_set_input_source */
  .sda_gpio = GPIO_I2C0_SDA,    /* See i2c_set_input_source */
  .scl_gpio = GPIO_I2C0_SCL,    /* See i2c_set_input_source */
  .frequency = (uint32_t)I2C_DEFAULT_FREQUENCY,
  .lock = NXMUTEX_INITIALIZER,
  .refs = 0,
};
#endif

#ifdef CONFIG_XMC4_I2C1
static struct xmc4_i2cdev_s g_i2c1 =
{
  .ops = &xmc4_i2c_ops,
  .base = XMC4_USIC0_CH1_BASE,
  .channel = USIC0_CHAN1,
  .dx0_sda = BOARD_I2C1_SDA_DX, /* See i2c_set_input_source */
  .dx1_scl = BOARD_I2C1_SCL_DX, /* See i2c_set_input_source */
  .sda_gpio = GPIO_I2C1_SDA,    /* See i2c_set_input_source */
  .scl_gpio = GPIO_I2C1_SCL,    /* See i2c_set_input_source */
  .frequency = (uint32_t)I2C_DEFAULT_FREQUENCY,
  .lock = NXMUTEX_INITIALIZER,
  .refs = 0,
};
#endif

#ifdef CONFIG_XMC4_I2C2
static struct xmc4_i2cdev_s g_i2c2 =
{
  .ops = &xmc4_i2c_ops,
  .base = XMC4_USIC1_CH0_BASE,
  .channel = USIC1_CHAN0,
  .dx0_sda = BOARD_I2C2_SDA_DX, /* See i2c_set_input_source */
  .dx1_scl = BOARD_I2C2_SCL_DX, /* See i2c_set_input_source */
  .sda_gpio = GPIO_I2C2_SDA,    /* See i2c_set_input_source */
  .scl_gpio = GPIO_I2C2_SCL,    /* See i2c_set_input_source */
  .frequency = (uint32_t)I2C_DEFAULT_FREQUENCY,
  .lock = NXMUTEX_INITIALIZER,
  .refs = 0,
};
#endif

#ifdef CONFIG_XMC4_I2C3
static struct xmc4_i2cdev_s g_i2c3 =
{
  .ops = &xmc4_i2c_ops,
  .base = XMC4_USIC1_CH1_BASE,
  .channel = USIC1_CHAN1,
  .dx0_sda = BOARD_I2C3_SDA_DX, /* See i2c_set_input_source */
  .dx1_scl = BOARD_I2C3_SCL_DX, /* See i2c_set_input_source */
  .sda_gpio = GPIO_I2C3_SDA,    /* See i2c_set_input_source */
  .scl_gpio = GPIO_I2C3_SCL,    /* See i2c_set_input_source */
  .frequency = (uint32_t)I2C_DEFAULT_FREQUENCY,
  .lock = NXMUTEX_INITIALIZER,
  .refs = 0,
};
#endif

#ifdef CONFIG_XMC4_I2C4
static struct xmc4_i2cdev_s g_i2c4 =
{
  .ops = &xmc4_i2c_ops,
  .base = XMC4_USIC2_CH0_BASE,
  .channel = USIC2_CHAN0,
  .dx0_sda = BOARD_I2C4_SDA_DX, /* See i2c_set_input_source */
  .dx1_scl = BOARD_I2C4_SCL_DX, /* See i2c_set_input_source */
  .sda_gpio = GPIO_I2C4_SDA,    /* See i2c_set_input_source */
  .scl_gpio = GPIO_I2C4_SCL,    /* See i2c_set_input_source */
  .frequency = (uint32_t)I2C_DEFAULT_FREQUENCY,
  .lock = NXMUTEX_INITIALIZER,
  .refs = 0,
};
#endif

#ifdef CONFIG_XMC4_I2C5
static struct xmc4_i2cdev_s g_i2c5 =
{
  .ops = &xmc4_i2c_ops,
  .base = XMC4_USIC2_CH1_BASE,
  .channel = USIC2_CHAN1,
  .dx0_sda = BOARD_I2C5_SDA_DX, /* See i2c_set_input_source */
  .dx1_scl = BOARD_I2C5_SCL_DX, /* See i2c_set_input_source */
  .sda_gpio = GPIO_I2C5_SDA,    /* See i2c_set_input_source */
  .scl_gpio = GPIO_I2C5_SCL,    /* See i2c_set_input_source */
  .frequency = (uint32_t)I2C_DEFAULT_FREQUENCY,
  .lock = NXMUTEX_INITIALIZER,
  .refs = 0,
};
#endif

/*****************************************************************************
 * Private Function
 *****************************************************************************/

/* I2C register related functions */

static inline void xmc4_i2c_putreg32(struct xmc4_i2cdev_s *priv,
                                     uint32_t offset,
                                     uint32_t value)
{
  putreg32(value, priv->base + offset);
}

static inline uint32_t xmc4_i2c_getreg32(struct xmc4_i2cdev_s *priv,
                                         uint32_t offset)
{
  return getreg32(priv->base + offset);
}

static inline void xmc4_i2c_modifyreg32(struct xmc4_i2cdev_s *priv,
                                 uint32_t offset,
                                 uint32_t clearbits,
                                 uint32_t setbits)
{
  modifyreg32(priv->base + offset, clearbits, setbits);
}

/*****************************************************************************
 * Name: i2c_initialize
 *
 * Description:
 *   Initialize USIC channel for I2C operations.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int i2c_initialize(struct xmc4_i2cdev_s *priv)
{
  int ret;

  ret = xmc4_enable_usic_channel(priv->channel);

  /* Data format configuration */

  uint32_t sctr = ((uint32_t)I2C_TRM_MODE << (uint32_t)USIC_SCTR_TRM_SHIFT) |
                ((uint32_t)I2C_WORDLENGTH << (uint32_t)USIC_SCTR_WLE_SHIFT) |
                  (uint32_t)USIC_SCTR_FLE_MASK | /* unlimited data flow */
                  (uint32_t)USIC_SCTR_SDIR |     /* MSB shifted first */
                  (uint32_t)USIC_SCTR_PDL;       /* Passive Data Level */
  xmc4_i2c_putreg32(priv, XMC4_USIC_SCTR_OFFSET, sctr);

  /* Set baudrate */

  ret |= i2c_set_baudrate(priv);

  /* Enable transfer buffer */

  uint32_t tcsr = ((uint32_t)I2C_TDV_SET << (uint32_t)USIC_TCSR_TDEN_SHIFT) |
                                            (uint32_t)USIC_TCSR_TDSSM;
  xmc4_i2c_putreg32(priv, XMC4_USIC_TCSR_OFFSET, tcsr);

  /* Clear status flags */

  ret |= i2c_clear_status_flag(priv, 0x1ffff);

  /* Disable parity generation */

  xmc4_i2c_putreg32(priv, XMC4_USIC_CCR_OFFSET, 0);

  /* Set DX0m and DX1n as input sources for SDA & SCL */

  ret |= i2c_set_input_source(priv);

  /* Set USIC channel in I2C mode */

  i2c_start_channel(priv);

  /* Configure signal outputs pin */

  xmc4_gpio_config((gpioconfig_t)priv->sda_gpio); /* GPIO_I2C_SDA is DOUT0 */
  xmc4_gpio_config((gpioconfig_t)priv->scl_gpio); /* GPIO_I2C_SCL is SCLKOUT */

  return ret;
}

/*****************************************************************************
 * Name: i2c_uninitialize
 *
 * Description:
 *   Reset USIC channel.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

