apache/nuttx/arch/arm/src/xmc4/xmc4_i2c.c
static int i2c_uninitialize(struct xmc4_i2cdev_s *priv)
{
  xmc4_i2c_putreg32(priv, XMC4_USIC_PSCR_OFFSET, 0);
  xmc4_i2c_putreg32(priv, XMC4_USIC_PCR_OFFSET, 0);
  xmc4_i2c_putreg32(priv, XMC4_USIC_CCR_OFFSET, 0);

  return xmc4_disable_usic_channel(priv->channel);
}

/*****************************************************************************
 * Name: i2c_set_baudrate
 *
 * Description:
 *   Set the baudrate of the USIC channel. Baudrate should be in [100-400k]Hz.
 *   Baudrate can't be changed while the USIC is running.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int i2c_set_baudrate(struct xmc4_i2cdev_s *priv)
{
  int ret;

  if (priv->frequency <= (uint32_t)XMC_I2C_MAX_SPEED_STANDARD)
    {
      xmc4_i2c_modifyreg32(priv, XMC4_USIC_PCR_OFFSET, USIC_PCR_IICMODE_STIM,
                          ~USIC_PCR_IICMODE_STIM);

      ret = xmc4_usic_baudrate(priv->channel, priv->frequency,
                              XMC_I2C_CLOCK_OVERSAMPLING_STANDARD);
    }
  else if (priv->frequency <= (uint32_t)XMC_I2C_MAX_SPEED_FAST)
    {
      xmc4_i2c_modifyreg32(priv, XMC4_USIC_PCR_OFFSET, USIC_PCR_IICMODE_STIM,
                          USIC_PCR_IICMODE_STIM);

      ret = xmc4_usic_baudrate(priv->channel, priv->frequency,
                              XMC_I2C_CLOCK_OVERSAMPLING_FAST);
    }
  else
    {
      ret = -EINVAL;
      i2cerr("Selected baudrate isn't supported : [100-400k]Hz\n");
    }

  return ret;
}

/*****************************************************************************
 * Name: i2c_set_input_source
 *
 * Description:
 *   Sets the input source for I2C. Defines the input stage for the
 *   corresponding input line. BOARD_I2Cx_SDA_DX, BOARD_I2Cx_SCL_DX,
 *   GPIO_I2Cx_SDA and GPIO_I2Cx_SCL must be defined in board.h
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int i2c_set_input_source(struct xmc4_i2cdev_s *priv)
{
  /* Configure I2C pins and input sources.
   *
   * NOTE that the board must provide the definitions in the board.h header
   * file of the form like:  GPIO_I2Cx_SDA and GPIO_I2Cx_SCL where x is
   * the I2C port number (U0C0 = 0, U0C1 = 1, U1C0 = 3 ... U2C1 = 5)
   *
   * In additional, the board.h must provide the definition of
   * BOARD_I2Cx_SDA_DX and BOARD_I2Cx_SCL_DX which indicates which input
   * source signal is selected, (0=DX_A, 1=DX_B, ... 6=DX_G).
   * Use enum uart_dx_e.
   */

  if ((priv->dx0_sda > XMC_USIC_CH_INPUT_DXN1) ||
      (priv->dx1_scl > XMC_USIC_CH_INPUT_DXN1))
    {
      return -EINVAL;
    }

  /* Set DX0 config */

  xmc4_i2c_modifyreg32(priv, XMC4_USIC_DX0CR_OFFSET,
                       USIC_DXCR_INSW, USIC_DXCR_DSEN);

  /* Set DX0 source [G:A] */

  xmc4_i2c_modifyreg32(priv, XMC4_USIC_DX0CR_OFFSET,
                       USIC_DXCR_DSEL_MASK, USIC_DXCR_DSEL_DX(priv->dx0_sda));

  /* Set DX1 config */

  xmc4_i2c_modifyreg32(priv, XMC4_USIC_DX1CR_OFFSET,
                       USIC_DXCR_INSW, USIC_DXCR_DSEN);

  /* Set DX1 source [G:A] */

  xmc4_i2c_modifyreg32(priv, XMC4_USIC_DX1CR_OFFSET,
                       USIC_DXCR_DSEL_MASK, USIC_DXCR_DSEL_DX(priv->dx1_scl));

  return OK;
}

/*****************************************************************************
 * Name: i2c_start_channel
 *
 * Description:
 *   Leave USIC channel from idle mode and set I2C mode.
 *
 *****************************************************************************/

static void i2c_start_channel(struct xmc4_i2cdev_s *priv)
{
  /* Sets the USIC input operation mode to I2C mode using CCR register. */

  xmc4_i2c_modifyreg32(priv, XMC4_USIC_CCR_OFFSET,
                       USIC_CCR_MODE_MASK, USIC_CCR_MODE_I2C);
}

/*****************************************************************************
 * Name: i2c_stop_channel
 *
 * Description:
 *   Wait for current transmit to end and set the USIC channel in idle mode.
 *
 *****************************************************************************/

static void i2c_stop_channel(struct xmc4_i2cdev_s *priv)
{
  /* Sets the USIC input operation mode to idle mode using CCR register. */

  while (i2c_get_transmit_buffer_status(priv) == 1)
    {
      /* wait for transmit to end */
    }

  xmc4_i2c_modifyreg32(priv, XMC4_USIC_CCR_OFFSET, USIC_CCR_MODE_MASK, 0);
}

/*****************************************************************************
 * Name: i2c_get_status_flag
 *
 * Description:
 *   Return the flags from PSR register.
 *
 * Returned Value:
 *   FALSE if selected flags are 0
 *   else TRUE if one of the selected flags isn't 0.
 *
 *****************************************************************************/

static bool i2c_get_status_flag(struct xmc4_i2cdev_s *priv,
                             const uint32_t flag_mask)
{
  uint32_t psr = xmc4_i2c_getreg32(priv, XMC4_USIC_PSR_OFFSET);

  return ((psr & flag_mask) != 0);
}

/*****************************************************************************
 * Name: i2c_clear_status_flag
 *
 * Description:
 *   Clear the flags from PSR register by writing in PSCR register.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

static int i2c_clear_status_flag(struct xmc4_i2cdev_s *priv,
                          const uint32_t flag_mask)
{
  if (flag_mask > 0x1ffff)
    {
      return -EINVAL;
    }

  xmc4_i2c_modifyreg32(priv, XMC4_USIC_PSCR_OFFSET, 0, flag_mask);

  return OK;
}

/*****************************************************************************
 * Name: i2c_get_transmit_buffer_status
 *
 * Description:
 *   Get the status of the transmit buffer.
 *
 * Returned Value:
 *   ZERO if idle, else ONE if busy.
 *
 *****************************************************************************/

static bool i2c_get_transmit_buffer_status(struct xmc4_i2cdev_s *priv)
{
  uint32_t tbuf_stat = xmc4_i2c_getreg32(priv, XMC4_USIC_TCSR_OFFSET);

