apache/nuttx/arch/arm/src/xmc4/xmc4_i2c.c
  return (tbuf_stat & (uint32_t)USIC_TCSR_TDV);
}

/*****************************************************************************
 * Name: i2c_fill_transmit_buffer
 *
 * Description:
 *   Wait for transmit buffer to be ready and fill the transmit buffer
 *   with given word data.
 *   TODO : enable FIFO mechanism so you don't have to wait.
 *
 *****************************************************************************/

static void i2c_fill_transmit_buffer(struct xmc4_i2cdev_s *priv,
                                      const uint32_t data)
{
  /* Check FIFO size */

  uint32_t tbctr = xmc4_i2c_getreg32(priv, XMC4_USIC_TBCTR_OFFSET);

  if ((tbctr & USIC_TBCTR_SIZE_MASK) == 0)
    {
      /* FIFO mechanism is disabled */

      while (i2c_get_transmit_buffer_status(priv) == 1)
        {
          /* check TDV, wait until TBUF is ready */
        }

      /* Clear Status Flag */

      i2c_clear_status_flag(priv, (uint32_t)USIC_PSR_IICMODE_TBIF);

      /* Put data in TBUF[0] */

      xmc4_i2c_putreg32(priv, XMC4_USIC_TBUF_OFFSET, data);
    }
  else
    {
      /* Put data in IN[0] */

      xmc4_i2c_putreg32(priv, XMC4_USIC_IN_OFFSET, data);
    }
}

/*****************************************************************************
 * Name: i2c_get_receive_buffer
 *
 * Description:
 *   Get the data word from receive buffer.
 *
 * Returned Value:
 *   Received data word in uint8_t.
 *
 *****************************************************************************/

static uint8_t i2c_get_receive_buffer(struct xmc4_i2cdev_s *priv)
{
  uint8_t retval;

  /* Check FIFO size */

  uint32_t rbctr = xmc4_i2c_getreg32(priv, XMC4_USIC_RBCTR_OFFSET);
  if ((rbctr & USIC_RBCTR_SIZE_SHIFT) == 0U)
    {
      retval = (uint8_t)xmc4_i2c_getreg32(priv, XMC4_USIC_RBUF_OFFSET);
    }
  else
    {
      retval = (uint8_t)xmc4_i2c_getreg32(priv, XMC4_USIC_OUTR_OFFSET);
    }

  return retval;
}

/*****************************************************************************
 * Name: i2c_start
 *
 * Description:
 *   Start and send an I2C frame with the given slave address.
 *   Send the following on bus : [START/RESTART A6 A5 A4 A3 A2 A1 A0 R/W]
 *
 *****************************************************************************/

static void i2c_start(struct xmc4_i2cdev_s *priv,
               const uint16_t addr,
               const bool read,
               const bool restart)
{
  uint32_t sent_data = (addr << 1);

  /* Add start transition */

  if (restart)
    {
      sent_data |= XMC_I2C_TDF_MASTER_RESTART;
    }
  else
    {
      sent_data |= XMC_I2C_TDF_MASTER_START;
    }

  if (read)
    {
      sent_data |= 0x01;
    }

  i2c_fill_transmit_buffer(priv, sent_data);
}

/*****************************************************************************
 * Name: i2c_stop
 *
 * Description:
 *   Stop an I2C frame.
 *   Send the following on bus : [STOP]
 *
 *****************************************************************************/

static void i2c_stop(struct xmc4_i2cdev_s *priv)
{
  uint32_t buff_data = (uint32_t)XMC_I2C_TDF_MASTER_STOP;
  i2c_fill_transmit_buffer(priv, buff_data);
}

/*****************************************************************************
 * Name: i2c_master_transmit
 *
 * Description:
 *   Transmit data on bus.
 *   Send the following on bus : [D7 D6 D5 D4 D3 D2 D1 D0]
 *
 *****************************************************************************/

static void i2c_master_transmit(struct xmc4_i2cdev_s *priv,
                                const uint8_t data)
{
  uint32_t buff_data = (uint32_t)(data | (uint32_t)XMC_I2C_TDF_MASTER_SEND);
  i2c_fill_transmit_buffer(priv, buff_data);
}

/*****************************************************************************
 * Name: i2c_master_ack
 *
 * Description:
 *   Answer with a master acknowledge.
 *   Send the following on bus : [ACK]
 *
 *****************************************************************************/

static void i2c_master_ack(struct xmc4_i2cdev_s *priv)
{
  uint32_t buff_data = (uint32_t)XMC_I2C_TDF_MASTER_RECEIVE_ACK;
  i2c_fill_transmit_buffer(priv, buff_data);
}

/*****************************************************************************
 * Name: i2c_master_nack
 *
 * Description:
 *   Answer with a master not-acknowledge.
 *   Send the following on bus : [NACK]
 *
 *****************************************************************************/

static void i2c_master_nack(struct xmc4_i2cdev_s *priv)
{
  uint32_t buff_data = (uint32_t)XMC_I2C_TDF_MASTER_RECEIVE_NACK;
  i2c_fill_transmit_buffer(priv, buff_data);
}

/*****************************************************************************
 * Name: i2c_wait_for_slave_ack
 *
 * Description:
 *   Wait for the slave on bus to acknowledge.
 *
 *****************************************************************************/

static void i2c_wait_for_slave_ack(struct xmc4_i2cdev_s *priv)
{
  while (i2c_get_status_flag(priv, (uint32_t)USIC_PSR_IICMODE_ACK) == false)
    {
      /* Wait for ACK */
    }

  i2c_clear_status_flag(priv, (uint32_t)USIC_PSR_IICMODE_ACK);
}

/*****************************************************************************
 * Name: i2c_wait_for_received_data_ready
 *
 * Description:
 *   Wait for the received data buffer to be ready to be read.
 *
 *****************************************************************************/

static void i2c_wait_for_received_data_ready(struct xmc4_i2cdev_s *priv)
{
  while (i2c_get_status_flag(priv, (uint32_t)(USIC_PSR_IICMODE_RIF |
                                              USIC_PSR_IICMODE_AIF)) == false)
    {
      /* Wait for RIF */
    }

  i2c_clear_status_flag(priv, (uint32_t)(USIC_PSR_IICMODE_RIF |
                                         USIC_PSR_IICMODE_AIF));
}

/*****************************************************************************
 * Name: i2c_transfer
 *
 * Description:
 *   Generic I2C transfer.
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 *****************************************************************************/

