apache/nuttx/arch/arm/src/xmc4/xmc4_i2c.c
static int i2c_transfer(struct i2c_master_s *dev,
                        struct i2c_msg_s *msgs,
                        int count)
{
  struct xmc4_i2cdev_s *priv = (struct xmc4_i2cdev_s *)dev;

  int ret = OK;

  bool previous_msg_no_stop = false;

  /* Get exclusive access to the I2C bus */

  nxmutex_lock(&priv->lock);

  /* Enter critical section to avoid interrupts during i2c transfer */

  irqstate_t state = enter_critical_section();

  for (int i = 0; i < count; i++)
    {
      /* Check if frequency must be changed */

      if (msgs[i].frequency != priv->frequency)
        {
          priv->frequency = msgs[i].frequency;

          if (!previous_msg_no_stop)
            {
              i2c_stop_channel(priv);

              i2c_set_baudrate(priv);

              i2c_start_channel(priv);
            }
          else
            {
              i2cerr("Can't update frequency between Start & Stop symbols\n");
              leave_critical_section(state);
              nxmutex_unlock(&priv->lock);
              return -EINVAL;
            }
        }

      /* R/W bit */

      bool read = ((msgs[i].flags & I2C_M_READ) != 0);

      /* Check if you should start or restart a new i2c frame */

      if ((msgs[i].flags & I2C_M_NOSTART) == 0)
        {
          if (previous_msg_no_stop)
            {
              /* Repeated start */

              i2c_start(priv, msgs[i].addr, read, true);
              i2c_wait_for_slave_ack(priv);
            }
          else
            {
              /*  Normal start */

              i2c_start(priv, msgs[i].addr, read, false);
              i2c_wait_for_slave_ack(priv);
            }
        }

      /* Parse buffer data */

      for (int j = 0; j < (msgs[i].length); j++)
        {
          if (read)
            {
              /* Answer ack (or nack if last buffer) */

              if (j == ((msgs[i].length) - 1))
                {
                  i2c_master_nack(priv);
                }
              else
                {
                  i2c_master_ack(priv);
                }

              i2c_wait_for_received_data_ready(priv);

              /* Save received data */

              msgs[i].buffer[j] = i2c_get_receive_buffer(priv);
            }
          else
            {
              i2c_master_transmit(priv, msgs[i].buffer[j]);
              i2c_wait_for_slave_ack(priv);
            }
        }

      /* Check if you should not stop the i2c frame
      * msg has NO_STOP or next msg has NO_START flag
      */

      bool message_has_no_stop = ((msgs[i].flags & I2C_M_NOSTOP) != 0);

      bool next_message_has_no_start = false;

      if (i < count)
        {
          next_message_has_no_start =
                                ((msgs[i + 1].flags & I2C_M_NOSTART) != 0);
        }

      bool should_stop = !(message_has_no_stop || next_message_has_no_start);

      /* TODO : Should you stop when last msg and override flags ? */

      if (should_stop)
        {
          i2c_stop(priv);
        }
      else
        {
          previous_msg_no_stop = true;
        }
    }

  leave_critical_section(state);
  nxmutex_unlock(&priv->lock);
  return ret;
}

#ifdef CONFIG_I2C_RESET
int i2c_reset(struct i2c_master_s *dev)
{
#error not implemented
}
#endif

/*****************************************************************************
 * Public Functions
 *****************************************************************************/

/*****************************************************************************
 * Name: xmc4_i2cbus_initialize
 *
 * Description:
 *   Initialise an I2C device
 *
 *****************************************************************************/

struct i2c_master_s *xmc4_i2cbus_initialize(int port)
{
  struct xmc4_i2cdev_s *priv = NULL;

  switch (port)
    {
#ifdef CONFIG_XMC4_I2C0
      case 0:
      {
        priv = (struct xmc4_i2cdev_s *)&g_i2c0;
        break;
      }
#endif

#ifdef CONFIG_XMC4_I2C1
      case 1:
      {
        priv = (struct xmc4_i2cdev_s *)&g_i2c1;
        break;
      }
#endif

#ifdef CONFIG_XMC4_I2C2
      case 2:
      {
        priv = (struct xmc4_i2cdev_s *)&g_i2c2;
        break;
      }
#endif

#ifdef CONFIG_XMC4_I2C3
      case 3:
      {
        priv = (struct xmc4_i2cdev_s *)&g_i2c3;
        break;
      }
#endif

#ifdef CONFIG_XMC4_I2C4
      case 4:
      {
        priv = (struct xmc4_i2cdev_s *)&g_i2c4;
        break;
      }
#endif

#ifdef CONFIG_XMC4_I2C5
      case 5:
      {
        priv = (struct xmc4_i2cdev_s *)&g_i2c5;
        break;
      }
#endif

      default:
      {
        i2cerr("No such i2c module.\n");
        return NULL;
      }
    }

  nxmutex_lock(&priv->lock);

  if (priv->refs++ == 0)
    {
      int ret = i2c_initialize(priv);
      if (ret < 0)
        {
          nxmutex_unlock(&priv->lock);
          return NULL;
        }
    }

  nxmutex_unlock(&priv->lock);

  return (struct i2c_master_s *)priv;
}

/*****************************************************************************
 * Name: xmc4_i2cbus_uninitialize
 *
 * Description:
 *   Uninitialise an I2C device
 *
 *****************************************************************************/

int xmc4_i2cbus_uninitialize(struct i2c_master_s *dev)
{
  struct xmc4_i2cdev_s *priv = (struct xmc4_i2cdev_s *)dev;

  if (priv->refs == 0)
    {
      return ERROR;
    }

  nxmutex_lock(&priv->lock);

  if (--priv->refs)
    {
      nxmutex_unlock(&priv->lock);
      kmm_free(dev);
      return OK;
    }

  i2c_uninitialize(priv);

  nxmutex_unlock(&priv->lock);

  kmm_free(dev);

  return OK;
}

#endif /* CONFIG_XMC4_USCI_I2C */
